==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
EEGNet                                   [1, 4]                    --
├─Sequential: 1-1                        [1, 17, 1, 428]           --
│    └─Conv2d: 2-1                       [1, 500, 17, 61]          --
│    │    └─Conv2d: 3-1                  [1, 61, 500, 17]          3,111
│    └─BatchNorm2d: 2-2                  [1, 500, 17, 61]          --
│    │    └─BatchNorm2d: 3-2             [1, 61, 17, 500]          122
│    └─Conv2d: 2-3                       [1, 500, 1, 244]          --
│    │    └─Conv2d: 3-3                  [1, 244, 500, 1]          4,148
│    └─BatchNorm2d: 2-4                  [1, 500, 1, 244]          --
│    │    └─BatchNorm2d: 3-4             [1, 244, 1, 500]          488
│    └─ELU: 2-5                          [1, 500, 1, 244]          --
│    └─Pooling2d: 2-6                    [1, 125, 1, 244]          --
│    │    └─AvgPool2d: 3-5               [1, 244, 125, 1]          --
│    └─Dropout: 2-7                      [1, 125, 1, 244]          --
│    └─Conv2d: 2-8                       [1, 125, 1, 16]           --
│    │    └─Conv2d: 3-6                  [1, 16, 125, 1]           11,712
│    └─BatchNorm2d: 2-9                  [1, 125, 1, 16]           --
│    │    └─BatchNorm2d: 3-7             [1, 16, 1, 125]           32
│    └─ReLU: 2-10                        [1, 125, 1, 16]           --
│    └─ResidualBlock: 2-11               [1, 125, 1, 16]           --
│    │    └─Conv2d: 3-8                  [1, 125, 1, 16]           768
│    │    └─BatchNorm2d: 3-9             [1, 125, 1, 16]           32
│    │    └─ReLU: 3-10                   [1, 125, 1, 16]           --
│    │    └─Conv2d: 3-11                 [1, 125, 1, 16]           768
│    │    └─BatchNorm2d: 3-12            [1, 125, 1, 16]           32
│    │    └─Sequential: 3-13             [1, 125, 1, 16]           --
│    │    └─ReLU: 3-14                   [1, 125, 1, 16]           --
│    └─Conv2d: 2-12                      [1, 125, 1, 3904]         --
│    │    └─Conv2d: 3-15                 [1, 3904, 125, 1]         58,560
│    └─Conv2d: 2-13                      [1, 125, 1, 428]          --
│    │    └─Conv2d: 3-16                 [1, 428, 125, 1]          1,670,912
│    └─BatchNorm2d: 2-14                 [1, 125, 1, 428]          --
│    │    └─BatchNorm2d: 3-17            [1, 428, 1, 125]          856
│    └─ELU: 2-15                         [1, 125, 1, 428]          --
│    └─Pooling2d: 2-16                   [1, 17, 1, 428]           --
│    │    └─AvgPool2d: 3-18              [1, 428, 17, 1]           --
│    └─Dropout: 2-17                     [1, 17, 1, 428]           --
├─Sequential: 1-2                        [1, 4]                    --
│    └─Flatten: 2-18                     [1, 7276]                 --
│    └─Linear: 2-19                      [1, 4]                    --
│    │    └─Linear: 3-19                 [1, 4]                    29,108
│    └─LogSoftmax: 2-20                  [1, 4]                    --
==========================================================================================
Total params: 1,780,649
Trainable params: 1,780,649
Non-trainable params: 0
Total mult-adds (M): 246.39
==========================================================================================
Input size (MB): 0.03
Forward/backward pass size (MB): 15.10
Params size (MB): 7.12
Estimated Total Size (MB): 22.26
==========================================================================================